[Killed] ConditionalExpression
src/logic/badges.ts:137:44
   storage: BadgeStorage
 ): Promise<CheckBadgeProgressResult> {
   const definitions = await storage.getDefinitions();
-  const definition = definitions.find(d => d.badge_id === input.badgeId);
+  const definition = definitions.find(d => false);
   
   if (!definition) {
killedBy: Badges checkBadgeProgressLogic: returns unlocked false when progress below threshold
statusReason: expected undefined to be 5 // Object.is equality

[Killed] ArrowFunction
src/logic/badges.ts:137:39
   storage: BadgeStorage
 ): Promise<CheckBadgeProgressResult> {
   const definitions = await storage.getDefinitions();
-  const definition = definitions.find(d => d.badge_id === input.badgeId);
+  const definition = definitions.find(() => undefined);
   
   if (!definition) {
killedBy: Badges checkBadgeProgressLogic: returns unlocked false when progress below threshold
statusReason: expected undefined to be 5 // Object.is equality

[Killed] ConditionalExpression
src/logic/badges.ts:143:7
     return { unlocked: false };
   }
 
-  if (definition.criteria.game_type !== undefined && definition.criteria.game_type !== input.gameType) {
+  if (false) {
     return { unlocked: false };
   }
killedBy: Badges checkBadgeProgressLogic: checks game type when specified
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/logic/badges.ts:143:54
     return { unlocked: false };
   }
 
-  if (definition.criteria.game_type !== undefined && definition.criteria.game_type !== input.gameType) {
+  if (definition.criteria.game_type !== undefined && definition.criteria.game_type === input.gameType) {
     return { unlocked: false };
   }
killedBy: Badges checkBadgeProgressLogic: checks game type when specified
statusReason: expected true to be false // Object.is equality

[NoCoverage] ConditionalExpression
src/logic/badges.ts:148:50
   }
 
   const { profile } = await storage.getProfile(input.userId);
-  const existingBadge = profile.badges.find(b => b.badge_id === input.badgeId);
+  const existingBadge = profile.badges.find(b => false);
   
   if (existingBadge) {

[NoCoverage] EqualityOperator
src/logic/badges.ts:148:50
   }
 
   const { profile } = await storage.getProfile(input.userId);
-  const existingBadge = profile.badges.find(b => b.badge_id === input.badgeId);
+  const existingBadge = profile.badges.find(b => b.badge_id !== input.badgeId);
   
   if (existingBadge) {

[NoCoverage] BlockStatement
src/logic/badges.ts:150:22
   const { profile } = await storage.getProfile(input.userId);
   const existingBadge = profile.badges.find(b => b.badge_id === input.badgeId);
   
-  if (existingBadge) {
-    return { unlocked: true, progress: existingBadge.max_progress, max_progress: existingBadge.max_progress };
-  }
+  if (existingBadge) {}
 
   const progress = input.currentValue;

[Killed] EqualityOperator
src/logic/badges.ts:156:20
 
   const progress = input.currentValue;
   const threshold = definition.criteria.threshold;
-  const unlocked = progress >= threshold;
+  const unlocked = progress > threshold;
 
   return {
killedBy: Badges checkBadgeProgressLogic: returns unlocked true when progress meets threshold
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/logic/badges.ts:156:20
 
   const progress = input.currentValue;
   const threshold = definition.criteria.threshold;
-  const unlocked = progress >= threshold;
+  const unlocked = progress < threshold;
 
   return {
killedBy: Badges checkBadgeProgressLogic: returns unlocked false when progress below threshold
statusReason: expected true to be false // Object.is equality

[Killed] MethodExpression
src/logic/badges.ts:160:15
 
   return {
     unlocked,
-    progress: Math.min(progress, threshold),
+    progress: Math.max(progress, threshold),
     max_progress: threshold,
   };
killedBy: Badges checkBadgeProgressLogic: returns unlocked false when progress below threshold
statusReason: expected 10 to be 5 // Object.is equality

[Killed] EqualityOperator
src/logic/badges.ts:198:44
   }
 ): Promise<UnlockBadgeResult> {
   const definitions = await storage.getDefinitions();
-  const definition = definitions.find(d => d.badge_id === input.badgeId);
+  const definition = definitions.find(d => d.badge_id !== input.badgeId);
   
   if (!definition) {
killedBy: Badges unlockBadgeLogic: unlocks badge when criteria met
statusReason: expected 'pro_silver' to be 'pro_bronze' // Object.is equality

[Killed] EqualityOperator
src/logic/badges.ts:207:10
   const maxRetries = 5;
   let retries = 0;
   
-  while (retries < maxRetries) {
+  while (retries >= maxRetries) {
     try {
       if (input.checkAborted?.()) {
killedBy: Badges unlockBadgeLogic: unlocks badge when criteria met
statusReason: expected false to be true // Object.is equality

[Survived] EqualityOperator
src/logic/badges.ts:207:10
   const maxRetries = 5;
   let retries = 0;
   
-  while (retries < maxRetries) {
+  while (retries <= maxRetries) {
     try {
       if (input.checkAborted?.()) {

[Survived] ConditionalExpression
src/logic/badges.ts:209:11
   
   while (retries < maxRetries) {
     try {
-      if (input.checkAborted?.()) {
+      if (false) {
         throw new Error('Request aborted');
       }

[NoCoverage] BlockStatement
src/logic/badges.ts:209:35
   
   while (retries < maxRetries) {
     try {
-      if (input.checkAborted?.()) {
-        throw new Error('Request aborted');
-      }
+      if (input.checkAborted?.()) {}
       const { profile, etag } = await storage.getProfile(input.userId);
       

[Survived] ConditionalExpression
src/logic/badges.ts:214:54
       }
       const { profile, etag } = await storage.getProfile(input.userId);
       
-      const existingBadge = profile.badges.find(b => b.badge_id === input.badgeId);
+      const existingBadge = profile.badges.find(b => false);
       if (existingBadge) {
         const rewardsAlreadyClaimed = existingBadge.rewards_claimed === true;

[Survived] ConditionalExpression
src/logic/badges.ts:214:54
       }
       const { profile, etag } = await storage.getProfile(input.userId);
       
-      const existingBadge = profile.badges.find(b => b.badge_id === input.badgeId);
+      const existingBadge = profile.badges.find(b => true);
       if (existingBadge) {
         const rewardsAlreadyClaimed = existingBadge.rewards_claimed === true;

[Killed] ConditionalExpression
src/logic/badges.ts:216:39
       
       const existingBadge = profile.badges.find(b => b.badge_id === input.badgeId);
       if (existingBadge) {
-        const rewardsAlreadyClaimed = existingBadge.rewards_claimed === true;
+        const rewardsAlreadyClaimed = true;
         
         if (!rewardsAlreadyClaimed && creditStorage) {
killedBy: Badges unlockBadgeLogic: does not unlock already unlocked badge
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/logic/badges.ts:216:39
       
       const existingBadge = profile.badges.find(b => b.badge_id === input.badgeId);
       if (existingBadge) {
-        const rewardsAlreadyClaimed = existingBadge.rewards_claimed === true;
+        const rewardsAlreadyClaimed = existingBadge.rewards_claimed !== true;
         
         if (!rewardsAlreadyClaimed && creditStorage) {
killedBy: Badges unlockBadgeLogic: does not unlock already unlocked badge
statusReason: expected true to be false // Object.is equality

[NoCoverage] BlockStatement
src/logic/badges.ts:221:41
         if (!rewardsAlreadyClaimed && creditStorage) {
           let rewardsClaimedNow = false;
           for (const reward of definition.rewards) {
-            if (input.checkAborted?.()) {
-              break;
-            }
+            if (input.checkAborted?.()) {}
             if (reward.one_time) {
               if (reward.type === BadgeRewardType.GPGlobal) {

[NoCoverage] ConditionalExpression
src/logic/badges.ts:221:17
         if (!rewardsAlreadyClaimed && creditStorage) {
           let rewardsClaimedNow = false;
           for (const reward of definition.rewards) {
-            if (input.checkAborted?.()) {
+            if (false) {
               break;
             }

[NoCoverage] ConditionalExpression
src/logic/badges.ts:224:17
             if (input.checkAborted?.()) {
               break;
             }
-            if (reward.one_time) {
+            if (true) {
               if (reward.type === BadgeRewardType.GPGlobal) {
                 const result = await creditStorage.earnGP(

[NoCoverage] BlockStatement
src/logic/badges.ts:225:61
               break;
             }
             if (reward.one_time) {
-              if (reward.type === BadgeRewardType.GPGlobal) {
-                const result = await creditStorage.earnGP(
-                  input.userId,
-                  reward.amount || 0,
-                  `Badge reward: ${definition.name}`,
-                  undefined,
-                  { badge_id: input.badgeId, reward_type: reward.type, [MetadataField.IdempotencyKey]: badgeRewardIdempotencyKey(input.userId, input.badgeId, reward.type) }
-                );
-                if (result.success) rewardsClaimedNow = true;
-              } else if (reward.type === BadgeRewardType.GPPerGame && reward.game_type !== undefined) {
+              if (reward.type === BadgeRewardType.GPGlobal) {} else if (reward.type === BadgeRewardType.GPPerGame && reward.game_type !== undefined) {
                 const result = await creditStorage.earnGP(
                   input.userId,

[NoCoverage] ObjectLiteral
src/logic/badges.ts:231:19
                   reward.amount || 0,
                   `Badge reward: ${definition.name}`,
                   undefined,
-                  { badge_id: input.badgeId, reward_type: reward.type, [MetadataField.IdempotencyKey]: badgeRewardIdempotencyKey(input.userId, input.badgeId, reward.type) }
+                  {}
                 );
                 if (result.success) rewardsClaimedNow = true;

[NoCoverage] ConditionalExpression
src/logic/badges.ts:233:21
                   undefined,
                   { badge_id: input.badgeId, reward_type: reward.type, [MetadataField.IdempotencyKey]: badgeRewardIdempotencyKey(input.userId, input.badgeId, reward.type) }
                 );
-                if (result.success) rewardsClaimedNow = true;
+                if (true) rewardsClaimedNow = true;
               } else if (reward.type === BadgeRewardType.GPPerGame && reward.game_type !== undefined) {
                 const result = await creditStorage.earnGP(

[NoCoverage] ConditionalExpression
src/logic/badges.ts:233:21
                   undefined,
                   { badge_id: input.badgeId, reward_type: reward.type, [MetadataField.IdempotencyKey]: badgeRewardIdempotencyKey(input.userId, input.badgeId, reward.type) }
                 );
-                if (result.success) rewardsClaimedNow = true;
+                if (false) rewardsClaimedNow = true;
               } else if (reward.type === BadgeRewardType.GPPerGame && reward.game_type !== undefined) {
                 const result = await creditStorage.earnGP(

[NoCoverage] ConditionalExpression
src/logic/badges.ts:234:71
                   { badge_id: input.badgeId, reward_type: reward.type, [MetadataField.IdempotencyKey]: badgeRewardIdempotencyKey(input.userId, input.badgeId, reward.type) }
                 );
                 if (result.success) rewardsClaimedNow = true;
-              } else if (reward.type === BadgeRewardType.GPPerGame && reward.game_type !== undefined) {
+              } else if (reward.type === BadgeRewardType.GPPerGame && true) {
                 const result = await creditStorage.earnGP(
                   input.userId,

[NoCoverage] EqualityOperator
src/logic/badges.ts:234:26
                   { badge_id: input.badgeId, reward_type: reward.type, [MetadataField.IdempotencyKey]: badgeRewardIdempotencyKey(input.userId, input.badgeId, reward.type) }
                 );
                 if (result.success) rewardsClaimedNow = true;
-              } else if (reward.type === BadgeRewardType.GPPerGame && reward.game_type !== undefined) {
+              } else if (reward.type !== BadgeRewardType.GPPerGame && reward.game_type !== undefined) {
                 const result = await creditStorage.earnGP(
                   input.userId,

[NoCoverage] ConditionalExpression
src/logic/badges.ts:252:15
 
           const saveResult = await storage.saveProfile(profile, etag);
 
-          if (!saveResult.success) {
+          if (true) {
             retries++;
             if (retries >= maxRetries) {

[NoCoverage] ConditionalExpression
src/logic/badges.ts:252:15
 
           const saveResult = await storage.saveProfile(profile, etag);
 
-          if (!saveResult.success) {
+          if (false) {
             retries++;
             if (retries >= maxRetries) {

[NoCoverage] UpdateOperator
src/logic/badges.ts:253:13
           const saveResult = await storage.saveProfile(profile, etag);
 
           if (!saveResult.success) {
-            retries++;
+            retries--;
             if (retries >= maxRetries) {
               return { success: false, error: 'Failed to claim rewards after retries (concurrent modification)' };

[NoCoverage] BlockStatement
src/logic/badges.ts:254:40
 
           if (!saveResult.success) {
             retries++;
-            if (retries >= maxRetries) {
-              return { success: false, error: 'Failed to claim rewards after retries (concurrent modification)' };
-            }
+            if (retries >= maxRetries) {}
             await new Promise(resolve => setTimeout(resolve, 10 * retries));
             continue;

[NoCoverage] EqualityOperator
src/logic/badges.ts:254:17
 
           if (!saveResult.success) {
             retries++;
-            if (retries >= maxRetries) {
+            if (retries > maxRetries) {
               return { success: false, error: 'Failed to claim rewards after retries (concurrent modification)' };
             }

[NoCoverage] ArrowFunction
src/logic/badges.ts:257:31
             if (retries >= maxRetries) {
               return { success: false, error: 'Failed to claim rewards after retries (concurrent modification)' };
             }
-            await new Promise(resolve => setTimeout(resolve, 10 * retries));
+            await new Promise(() => undefined);
             continue;
           }

[NoCoverage] ArithmeticOperator
src/logic/badges.ts:257:62
             if (retries >= maxRetries) {
               return { success: false, error: 'Failed to claim rewards after retries (concurrent modification)' };
             }
-            await new Promise(resolve => setTimeout(resolve, 10 * retries));
+            await new Promise(resolve => setTimeout(resolve, 10 / retries));
             continue;
           }

[NoCoverage] BlockStatement
src/logic/badges.ts:287:35
         },
       };
 
-      if (input.checkAborted?.()) {
-        throw new Error('Request aborted');
-      }
+      if (input.checkAborted?.()) {}
 
       profile.badges.push(badge);

[Survived] ConditionalExpression
src/logic/badges.ts:287:11
         },
       };
 
-      if (input.checkAborted?.()) {
+      if (false) {
         throw new Error('Request aborted');
       }

[Survived] ArithmeticOperator
src/logic/badges.ts:292:53
       }
 
       profile.badges.push(badge);
-      profile.badge_counts[definition.badge_type] = (profile.badge_counts[definition.badge_type] || 0) + 1;
+      profile.badge_counts[definition.badge_type] = (profile.badge_counts[definition.badge_type] || 0) - 1;
       profile.badge_counts.total = (profile.badge_counts.total || 0) + 1;
       profile.last_updated = new Date().toISOString();

[Survived] ArithmeticOperator
src/logic/badges.ts:293:36
 
       profile.badges.push(badge);
       profile.badge_counts[definition.badge_type] = (profile.badge_counts[definition.badge_type] || 0) + 1;
-      profile.badge_counts.total = (profile.badge_counts.total || 0) + 1;
+      profile.badge_counts.total = (profile.badge_counts.total || 0) - 1;
       profile.last_updated = new Date().toISOString();
 

[Survived] LogicalOperator
src/logic/badges.ts:293:37
 
       profile.badges.push(badge);
       profile.badge_counts[definition.badge_type] = (profile.badge_counts[definition.badge_type] || 0) + 1;
-      profile.badge_counts.total = (profile.badge_counts.total || 0) + 1;
+      profile.badge_counts.total = (profile.badge_counts.total && 0) + 1;
       profile.last_updated = new Date().toISOString();
 

[Killed] BlockStatement
src/logic/badges.ts:307:59
             break;
           }
           if (reward.one_time) {
-            if (reward.type === BadgeRewardType.GPGlobal) {
-              const result = await creditStorage.earnGP(
-                input.userId,
-                reward.amount || 0,
-                `Badge reward: ${definition.name}`,
-                undefined,
-                { badge_id: input.badgeId, reward_type: reward.type, [MetadataField.IdempotencyKey]: badgeRewardIdempotencyKey(input.userId, input.badgeId, reward.type) }
-              );
-              if (result.success) rewardsClaimed = true;
-            } else if (reward.type === BadgeRewardType.GPPerGame && reward.game_type !== undefined) {
+            if (reward.type === BadgeRewardType.GPGlobal) {} else if (reward.type === BadgeRewardType.GPPerGame && reward.game_type !== undefined) {
               const result = await creditStorage.earnGP(
                 input.userId,
killedBy: Badges unlockBadgeLogic: claims rewards when badge unlocked
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/logic/badges.ts:315:19
                 undefined,
                 { badge_id: input.badgeId, reward_type: reward.type, [MetadataField.IdempotencyKey]: badgeRewardIdempotencyKey(input.userId, input.badgeId, reward.type) }
               );
-              if (result.success) rewardsClaimed = true;
+              if (false) rewardsClaimed = true;
             } else if (reward.type === BadgeRewardType.GPPerGame && reward.game_type !== undefined) {
               const result = await creditStorage.earnGP(
killedBy: Badges unlockBadgeLogic: claims rewards when badge unlocked
statusReason: expected false to be true // Object.is equality

[Survived] ConditionalExpression
src/logic/badges.ts:315:19
                 undefined,
                 { badge_id: input.badgeId, reward_type: reward.type, [MetadataField.IdempotencyKey]: badgeRewardIdempotencyKey(input.userId, input.badgeId, reward.type) }
               );
-              if (result.success) rewardsClaimed = true;
+              if (true) rewardsClaimed = true;
             } else if (reward.type === BadgeRewardType.GPPerGame && reward.game_type !== undefined) {
               const result = await creditStorage.earnGP(

[NoCoverage] LogicalOperator
src/logic/badges.ts:316:24
                 { badge_id: input.badgeId, reward_type: reward.type, [MetadataField.IdempotencyKey]: badgeRewardIdempotencyKey(input.userId, input.badgeId, reward.type) }
               );
               if (result.success) rewardsClaimed = true;
-            } else if (reward.type === BadgeRewardType.GPPerGame && reward.game_type !== undefined) {
+            } else if (reward.type === BadgeRewardType.GPPerGame || reward.game_type !== undefined) {
               const result = await creditStorage.earnGP(
                 input.userId,

[NoCoverage] ConditionalExpression
src/logic/badges.ts:316:69
                 { badge_id: input.badgeId, reward_type: reward.type, [MetadataField.IdempotencyKey]: badgeRewardIdempotencyKey(input.userId, input.badgeId, reward.type) }
               );
               if (result.success) rewardsClaimed = true;
-            } else if (reward.type === BadgeRewardType.GPPerGame && reward.game_type !== undefined) {
+            } else if (reward.type === BadgeRewardType.GPPerGame && true) {
               const result = await creditStorage.earnGP(
                 input.userId,

[Killed] BlockStatement
src/logic/badges.ts:335:32
 
       const saveResult = await storage.saveProfile(profile, etag);
 
-      if (!saveResult.success) {
-        if (input.checkAborted?.()) {
-          throw new Error('Request aborted');
-        }
-        retries++;
-        if (retries >= maxRetries) {
-          return { success: false, error: 'Failed to save badge profile after retries (concurrent modification)' };
-        }
-        await new Promise(resolve => setTimeout(resolve, 10 * retries));
-        if (input.checkAborted?.()) {
-          throw new Error('Request aborted');
-        }
-        continue;
-      }
+      if (!saveResult.success) {}
 
       return { success: true, badge, rewards_claimed: rewardsClaimed, already_unlocked: false };
killedBy: Badges unlockBadgeLogic: handles concurrent modification retries
statusReason: expected 1 to be 3 // Object.is equality

[Killed] ConditionalExpression
src/logic/badges.ts:336:13
       const saveResult = await storage.saveProfile(profile, etag);
 
       if (!saveResult.success) {
-        if (input.checkAborted?.()) {
+        if (true) {
           throw new Error('Request aborted');
         }
killedBy: Badges unlockBadgeLogic: handles concurrent modification retries
statusReason: expected false to be true // Object.is equality

[NoCoverage] BlockStatement
src/logic/badges.ts:336:37
       const saveResult = await storage.saveProfile(profile, etag);
 
       if (!saveResult.success) {
-        if (input.checkAborted?.()) {
-          throw new Error('Request aborted');
-        }
+        if (input.checkAborted?.()) {}
         retries++;
         if (retries >= maxRetries) {

[Survived] UpdateOperator
src/logic/badges.ts:339:9
         if (input.checkAborted?.()) {
           throw new Error('Request aborted');
         }
-        retries++;
+        retries--;
         if (retries >= maxRetries) {
           return { success: false, error: 'Failed to save badge profile after retries (concurrent modification)' };

[Killed] EqualityOperator
src/logic/badges.ts:340:13
           throw new Error('Request aborted');
         }
         retries++;
-        if (retries >= maxRetries) {
+        if (retries < maxRetries) {
           return { success: false, error: 'Failed to save badge profile after retries (concurrent modification)' };
         }
killedBy: Badges unlockBadgeLogic: handles concurrent modification retries
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/logic/badges.ts:340:13
           throw new Error('Request aborted');
         }
         retries++;
-        if (retries >= maxRetries) {
+        if (true) {
           return { success: false, error: 'Failed to save badge profile after retries (concurrent modification)' };
         }
killedBy: Badges unlockBadgeLogic: handles concurrent modification retries
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/logic/badges.ts:344:13
           return { success: false, error: 'Failed to save badge profile after retries (concurrent modification)' };
         }
         await new Promise(resolve => setTimeout(resolve, 10 * retries));
-        if (input.checkAborted?.()) {
+        if (true) {
           throw new Error('Request aborted');
         }
killedBy: Badges unlockBadgeLogic: handles concurrent modification retries
statusReason: expected false to be true // Object.is equality

[NoCoverage] BlockStatement
src/logic/badges.ts:344:37
           return { success: false, error: 'Failed to save badge profile after retries (concurrent modification)' };
         }
         await new Promise(resolve => setTimeout(resolve, 10 * retries));
-        if (input.checkAborted?.()) {
-          throw new Error('Request aborted');
-        }
+        if (input.checkAborted?.()) {}
         continue;
       }

[NoCoverage] BlockStatement
src/logic/badges.ts:351:21
       }
 
       return { success: true, badge, rewards_claimed: rewardsClaimed, already_unlocked: false };
-    } catch (error) {
-      if (error instanceof Error && error.message === 'Request aborted') {
-        return { success: false, error: 'Request aborted' };
-      }
-      if (retries >= maxRetries - 1) {
-        return { success: false, error: String(error) };
-      }
-      if (input.checkAborted?.()) {
-        return { success: false, error: 'Request aborted' };
-      }
-      retries++;
-      await new Promise(resolve => setTimeout(resolve, 10 * retries));
-      if (input.checkAborted?.()) {
-        return { success: false, error: 'Request aborted' };
-      }
-    }
+    } catch (error) {}
   }
 

[NoCoverage] ConditionalExpression
src/logic/badges.ts:352:11
 
       return { success: true, badge, rewards_claimed: rewardsClaimed, already_unlocked: false };
     } catch (error) {
-      if (error instanceof Error && error.message === 'Request aborted') {
+      if (false) {
         return { success: false, error: 'Request aborted' };
       }

[NoCoverage] ConditionalExpression
src/logic/badges.ts:352:37
 
       return { success: true, badge, rewards_claimed: rewardsClaimed, already_unlocked: false };
     } catch (error) {
-      if (error instanceof Error && error.message === 'Request aborted') {
+      if (error instanceof Error && true) {
         return { success: false, error: 'Request aborted' };
       }

[NoCoverage] EqualityOperator
src/logic/badges.ts:355:11
       if (error instanceof Error && error.message === 'Request aborted') {
         return { success: false, error: 'Request aborted' };
       }
-      if (retries >= maxRetries - 1) {
+      if (retries < maxRetries - 1) {
         return { success: false, error: String(error) };
       }

[NoCoverage] ConditionalExpression
src/logic/badges.ts:355:11
       if (error instanceof Error && error.message === 'Request aborted') {
         return { success: false, error: 'Request aborted' };
       }
-      if (retries >= maxRetries - 1) {
+      if (false) {
         return { success: false, error: String(error) };
       }

[NoCoverage] ConditionalExpression
src/logic/badges.ts:358:11
       if (retries >= maxRetries - 1) {
         return { success: false, error: String(error) };
       }
-      if (input.checkAborted?.()) {
+      if (true) {
         return { success: false, error: 'Request aborted' };
       }

[NoCoverage] ConditionalExpression
src/logic/badges.ts:358:11
       if (retries >= maxRetries - 1) {
         return { success: false, error: String(error) };
       }
-      if (input.checkAborted?.()) {
+      if (false) {
         return { success: false, error: 'Request aborted' };
       }

[NoCoverage] ArithmeticOperator
src/logic/badges.ts:362:56
         return { success: false, error: 'Request aborted' };
       }
       retries++;
-      await new Promise(resolve => setTimeout(resolve, 10 * retries));
+      await new Promise(resolve => setTimeout(resolve, 10 / retries));
       if (input.checkAborted?.()) {
         return { success: false, error: 'Request aborted' };

[NoCoverage] ArrowFunction
src/logic/badges.ts:362:25
         return { success: false, error: 'Request aborted' };
       }
       retries++;
-      await new Promise(resolve => setTimeout(resolve, 10 * retries));
+      await new Promise(() => undefined);
       if (input.checkAborted?.()) {
         return { success: false, error: 'Request aborted' };

[NoCoverage] BlockStatement
src/logic/badges.ts:363:35
       }
       retries++;
       await new Promise(resolve => setTimeout(resolve, 10 * retries));
-      if (input.checkAborted?.()) {
-        return { success: false, error: 'Request aborted' };
-      }
+      if (input.checkAborted?.()) {}
     }
   }

[NoCoverage] ConditionalExpression
src/logic/badges.ts:363:11
       }
       retries++;
       await new Promise(resolve => setTimeout(resolve, 10 * retries));
-      if (input.checkAborted?.()) {
+      if (false) {
         return { success: false, error: 'Request aborted' };
       }

[Killed] EqualityOperator
src/logic/badges.ts:407:7
     return { success: false, error: 'Badge definition not found' };
   }
 
-  if (definition.criteria.game_type !== undefined && definition.criteria.game_type !== input.gameType) {
+  if (definition.criteria.game_type === undefined && definition.criteria.game_type !== input.gameType) {
     return { success: false, error: 'Game type mismatch' };
   }
killedBy: Badges updateBadgeProgressLogic: validates game type when specified
statusReason: expected true to be false // Object.is equality

[Survived] ArrowFunction
src/logic/badges.ts:418:49
     try {
       const { profile, etag } = await storage.getProfile(input.userId);
       
-      const existingBadge = profile.badges.find(b => b.badge_id === input.badgeId);
+      const existingBadge = profile.badges.find(() => undefined);
       if (existingBadge) {
         return { success: true, unlocked: true };

[Survived] EqualityOperator
src/logic/badges.ts:418:54
     try {
       const { profile, etag } = await storage.getProfile(input.userId);
       
-      const existingBadge = profile.badges.find(b => b.badge_id === input.badgeId);
+      const existingBadge = profile.badges.find(b => b.badge_id !== input.badgeId);
       if (existingBadge) {
         return { success: true, unlocked: true };

[Survived] BlockStatement
src/logic/badges.ts:419:26
       const { profile, etag } = await storage.getProfile(input.userId);
       
       const existingBadge = profile.badges.find(b => b.badge_id === input.badgeId);
-      if (existingBadge) {
-        return { success: true, unlocked: true };
-      }
+      if (existingBadge) {}
 
       const threshold = definition.criteria.threshold;
