[Killed] ConditionalExpression
src/logic/credits.ts:72:7
   input: EarnGPInput,
   env: { CREDITS_DO?: DurableObjectNamespace }
 ): Promise<EarnGPResult> {
-  if (input.gpAmount <= 0) {
+  if (false) {
     return { success: false, error: 'GP amount must be greater than 0' };
   }
killedBy: Credits earnGPLogic: returns validation error when gpAmount is non-positive
statusReason: expected 'CREDITS_DO not configured' to be 'GP amount must be greater than 0' // Object.is equality

[Killed] EqualityOperator
src/logic/credits.ts:72:7
   input: EarnGPInput,
   env: { CREDITS_DO?: DurableObjectNamespace }
 ): Promise<EarnGPResult> {
-  if (input.gpAmount <= 0) {
+  if (input.gpAmount > 0) {
     return { success: false, error: 'GP amount must be greater than 0' };
   }
killedBy: Credits earnGPLogic: returns validation error when gpAmount is non-positive
statusReason: expected 'CREDITS_DO not configured' to be 'GP amount must be greater than 0' // Object.is equality

[Survived] ConditionalExpression
src/logic/credits.ts:93:15
       awardId,
       amount: input.gpAmount,
       description: input.description,
-      source: input.metadata?.source as CreditLedgerSource || CreditLedgerSource.Other,
+      source: false,
       metadata: input.metadata,
     };

[Survived] ConditionalExpression
src/logic/credits.ts:93:15
       awardId,
       amount: input.gpAmount,
       description: input.description,
-      source: input.metadata?.source as CreditLedgerSource || CreditLedgerSource.Other,
+      source: true,
       metadata: input.metadata,
     };

[Survived] ArrowFunction
src/logic/credits.ts:104:53
     });
 
     if (!response.ok) {
-      const errorText = await response.text().catch(() => '');
+      const errorText = await response.text().catch(() => undefined);
       return { success: false, error: `CreditsDO error: ${response.status} ${errorText}` };
     }

[Killed] LogicalOperator
src/logic/credits.ts:112:23
     return {
       success: result.success,
       already_processed: result.already_processed,
-      transaction_id: result.transaction_id || awardId,
+      transaction_id: result.transaction_id && awardId,
       new_balance: result.new_balance,
     };
killedBy: Credits earnGPLogic: forwards award to CreditsDO and returns success payload
statusReason: expected 'earn-1771089374726-ec46a548e16f49838b…' to be 'tx-award-1' // Object.is equality
