[Survived] ConditionalExpression
src/logic/badges.ts:419:11
       const { profile, etag } = await storage.getProfile(input.userId);
       
       const existingBadge = profile.badges.find(b => b.badge_id === input.badgeId);
-      if (existingBadge) {
+      if (false) {
         return { success: true, unlocked: true };
       }

[Killed] LogicalOperator
src/logic/badges.ts:424:32
       }
 
       const threshold = definition.criteria.threshold;
-      const existingProgress = profile.badge_progress[input.badgeId] || 0;
+      const existingProgress = profile.badge_progress[input.badgeId] && 0;
       const newProgress = Math.max(existingProgress, Math.min(input.progress, threshold));
       const unlocked = newProgress >= threshold;
killedBy: Badges updateBadgeProgressLogic: unlocks badge when progress meets threshold
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/logic/badges.ts:425:27
 
       const threshold = definition.criteria.threshold;
       const existingProgress = profile.badge_progress[input.badgeId] || 0;
-      const newProgress = Math.max(existingProgress, Math.min(input.progress, threshold));
+      const newProgress = Math.min(existingProgress, Math.min(input.progress, threshold));
       const unlocked = newProgress >= threshold;
 
killedBy: Badges updateBadgeProgressLogic: unlocks badge when progress meets threshold
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/logic/badges.ts:425:54
 
       const threshold = definition.criteria.threshold;
       const existingProgress = profile.badge_progress[input.badgeId] || 0;
-      const newProgress = Math.max(existingProgress, Math.min(input.progress, threshold));
+      const newProgress = Math.max(existingProgress, Math.max(input.progress, threshold));
       const unlocked = newProgress >= threshold;
 
killedBy: Badges updateBadgeProgressLogic: updates progress without unlocking when below threshold
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/logic/badges.ts:426:24
       const threshold = definition.criteria.threshold;
       const existingProgress = profile.badge_progress[input.badgeId] || 0;
       const newProgress = Math.max(existingProgress, Math.min(input.progress, threshold));
-      const unlocked = newProgress >= threshold;
+      const unlocked = false;
 
       profile.badge_progress[input.badgeId] = newProgress;
killedBy: Badges updateBadgeProgressLogic: unlocks badge when progress meets threshold
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/logic/badges.ts:426:24
       const threshold = definition.criteria.threshold;
       const existingProgress = profile.badge_progress[input.badgeId] || 0;
       const newProgress = Math.max(existingProgress, Math.min(input.progress, threshold));
-      const unlocked = newProgress >= threshold;
+      const unlocked = true;
 
       profile.badge_progress[input.badgeId] = newProgress;
killedBy: Badges updateBadgeProgressLogic: updates progress without unlocking when below threshold
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/logic/badges.ts:431:11
       profile.badge_progress[input.badgeId] = newProgress;
       profile.last_updated = new Date().toISOString();
 
-      if (unlocked) {
+      if (true) {
         const unlockResult = await unlockBadgeLogic(
           { userId: input.userId, badgeId: input.badgeId, gameType: input.gameType },
killedBy: Badges updateBadgeProgressLogic: updates progress without unlocking when below threshold
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/logic/badges.ts:431:21
       profile.badge_progress[input.badgeId] = newProgress;
       profile.last_updated = new Date().toISOString();
 
-      if (unlocked) {
-        const unlockResult = await unlockBadgeLogic(
-          { userId: input.userId, badgeId: input.badgeId, gameType: input.gameType },
-          storage,
-          creditStorage
-        );
-        return { success: unlockResult.success, unlocked: unlockResult.success, error: unlockResult.error };
-      }
+      if (unlocked) {}
 
       const saveResult = await storage.saveProfile(profile, etag);
killedBy: Badges updateBadgeProgressLogic: unlocks badge when progress meets threshold
statusReason: expected false to be true // Object.is equality

[NoCoverage] BlockStatement
src/logic/badges.ts:442:32
 
       const saveResult = await storage.saveProfile(profile, etag);
       
-      if (!saveResult.success) {
-        retries++;
-        if (retries >= maxRetries) {
-          return { success: false, error: 'Failed to save badge progress after retries (concurrent modification)' };
-        }
-        await new Promise(resolve => setTimeout(resolve, 10 * retries));
-        continue;
-      }
+      if (!saveResult.success) {}
 
       return { success: true, unlocked: false };

[NoCoverage] ConditionalExpression
src/logic/badges.ts:444:13
       
       if (!saveResult.success) {
         retries++;
-        if (retries >= maxRetries) {
+        if (false) {
           return { success: false, error: 'Failed to save badge progress after retries (concurrent modification)' };
         }

[NoCoverage] BlockStatement
src/logic/badges.ts:452:21
       }
 
       return { success: true, unlocked: false };
-    } catch (error) {
-      if (retries >= maxRetries - 1) {
-        return { success: false, error: String(error) };
-      }
-      retries++;
-      await new Promise(resolve => setTimeout(resolve, 10 * retries));
-    }
+    } catch (error) {}
   }
 

[NoCoverage] BlockStatement
src/logic/badges.ts:453:38
 
       return { success: true, unlocked: false };
     } catch (error) {
-      if (retries >= maxRetries - 1) {
-        return { success: false, error: String(error) };
-      }
+      if (retries >= maxRetries - 1) {}
       retries++;
       await new Promise(resolve => setTimeout(resolve, 10 * retries));

[NoCoverage] ConditionalExpression
src/logic/badges.ts:453:11
 
       return { success: true, unlocked: false };
     } catch (error) {
-      if (retries >= maxRetries - 1) {
+      if (true) {
         return { success: false, error: String(error) };
       }

[Killed] EqualityOperator
src/logic/badges.ts:485:7
   input: SetActiveBadgesInput,
   storage: BadgeStorage
 ): Promise<SetActiveBadgesResult> {
-  if (input.badgeIds.length > MaxActiveBadges) {
+  if (input.badgeIds.length <= MaxActiveBadges) {
     return { success: false, error: `Maximum ${MaxActiveBadges} active badges allowed` };
   }
killedBy: Badges setActiveBadgesLogic: sets active badges
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/logic/badges.ts:485:7
   input: SetActiveBadgesInput,
   storage: BadgeStorage
 ): Promise<SetActiveBadgesResult> {
-  if (input.badgeIds.length > MaxActiveBadges) {
+  if (false) {
     return { success: false, error: `Maximum ${MaxActiveBadges} active badges allowed` };
   }
killedBy: Badges setActiveBadgesLogic: rejects more than max active badges
statusReason: expected 'Invalid badge IDs: badge-0, badge-1, …' to contain 'Maximum'

[Killed] ConditionalExpression
src/logic/badges.ts:492:10
   const maxRetries = 5;
   let retries = 0;
 
-  while (retries < maxRetries) {
+  while (false) {
     try {
       const { profile, etag } = await storage.getProfile(input.userId);
killedBy: Badges setActiveBadgesLogic: sets active badges
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/logic/badges.ts:497:29
       const { profile, etag } = await storage.getProfile(input.userId);
       
       const userBadgeIds = new Set(profile.badges.map(b => b.badge_id));
-      const invalidBadges = input.badgeIds.filter(id => !userBadgeIds.has(id as BadgeIdValue));
+      const invalidBadges = input.badgeIds;
       
       if (invalidBadges.length > 0) {
killedBy: Badges setActiveBadgesLogic: sets active badges
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
src/logic/badges.ts:497:51
       const { profile, etag } = await storage.getProfile(input.userId);
       
       const userBadgeIds = new Set(profile.badges.map(b => b.badge_id));
-      const invalidBadges = input.badgeIds.filter(id => !userBadgeIds.has(id as BadgeIdValue));
+      const invalidBadges = input.badgeIds.filter(() => undefined);
       
       if (invalidBadges.length > 0) {
killedBy: Badges setActiveBadgesLogic: rejects invalid badge IDs
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/logic/badges.ts:499:11
       const userBadgeIds = new Set(profile.badges.map(b => b.badge_id));
       const invalidBadges = input.badgeIds.filter(id => !userBadgeIds.has(id as BadgeIdValue));
       
-      if (invalidBadges.length > 0) {
+      if (invalidBadges.length >= 0) {
         return { success: false, error: `Invalid badge IDs: ${invalidBadges.join(', ')}` };
       }
killedBy: Badges setActiveBadgesLogic: sets active badges
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/logic/badges.ts:499:11
       const userBadgeIds = new Set(profile.badges.map(b => b.badge_id));
       const invalidBadges = input.badgeIds.filter(id => !userBadgeIds.has(id as BadgeIdValue));
       
-      if (invalidBadges.length > 0) {
+      if (invalidBadges.length <= 0) {
         return { success: false, error: `Invalid badge IDs: ${invalidBadges.join(', ')}` };
       }
killedBy: Badges setActiveBadgesLogic: sets active badges
statusReason: expected false to be true // Object.is equality

[NoCoverage] BlockStatement
src/logic/badges.ts:518:21
       }
 
       return { success: true };
-    } catch (error) {
-      if (retries >= maxRetries - 1) {
-        return { success: false, error: String(error) };
-      }
-      retries++;
-      await new Promise(resolve => setTimeout(resolve, 10 * retries));
-    }
+    } catch (error) {}
   }
 

[NoCoverage] ConditionalExpression
src/logic/badges.ts:519:11
 
       return { success: true };
     } catch (error) {
-      if (retries >= maxRetries - 1) {
+      if (false) {
         return { success: false, error: String(error) };
       }
