[Killed] LogicalOperator
src/logic/payment-state-machine.ts:23:10
  * @mutation-invariant Return is exactly PAYMENT_VALID_TRANSITIONS[fromState] or [] when fromState not in table
  */
 export function getValidNextStates(fromState: string): string[] {
-  return PAYMENT_VALID_TRANSITIONS[fromState] ?? [];
+  return PAYMENT_VALID_TRANSITIONS[fromState] && [];
 }
 
killedBy: Payment PaymentStateMachine: allows INITIATED -> CHECKOUT_CREATED
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/logic/payment-state-machine.ts:39:7
   trigger?: string
 ): boolean {
   const validNext = getValidNextStates(fromState);
-  if (!validNext.includes(toState)) return false;
+  if (true) return false;
   if (
     fromState === 'INITIATED' &&
killedBy: Payment PaymentStateMachine: allows INITIATED -> CHECKOUT_CREATED
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/logic/payment-state-machine.ts:39:7
   trigger?: string
 ): boolean {
   const validNext = getValidNextStates(fromState);
-  if (!validNext.includes(toState)) return false;
+  if (false) return false;
   if (
     fromState === 'INITIATED' &&
killedBy: Payment PaymentStateMachine: rejects invalid transition PAYMENT_PENDING -> ENTITLEMENT_GRANTED
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/logic/payment-state-machine.ts:41:5
   const validNext = getValidNextStates(fromState);
   if (!validNext.includes(toState)) return false;
   if (
-    fromState === 'INITIATED' &&
-    toState === 'PAYMENT_SUCCEEDED' &&
-    trigger !== PaymentTrigger.ReconcileRepair
+    true
   ) {
     return false;
killedBy: Payment PaymentStateMachine: allows INITIATED -> CHECKOUT_CREATED
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/logic/payment-state-machine.ts:41:5
   const validNext = getValidNextStates(fromState);
   if (!validNext.includes(toState)) return false;
   if (
-    fromState === 'INITIATED' &&
-    toState === 'PAYMENT_SUCCEEDED' &&
+    true &&
     trigger !== PaymentTrigger.ReconcileRepair
   ) {
killedBy: Payment PaymentStateMachine: allows INITIATED -> CHECKOUT_CREATED
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/logic/payment-state-machine.ts:42:5
   if (!validNext.includes(toState)) return false;
   if (
     fromState === 'INITIATED' &&
-    toState === 'PAYMENT_SUCCEEDED' &&
+    true &&
     trigger !== PaymentTrigger.ReconcileRepair
   ) {
killedBy: Payment PaymentStateMachine: allows INITIATED -> CHECKOUT_CREATED
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/logic/payment-state-machine.ts:42:5
   if (!validNext.includes(toState)) return false;
   if (
     fromState === 'INITIATED' &&
-    toState === 'PAYMENT_SUCCEEDED' &&
+    toState !== 'PAYMENT_SUCCEEDED' &&
     trigger !== PaymentTrigger.ReconcileRepair
   ) {
killedBy: Payment PaymentStateMachine: allows INITIATED -> CHECKOUT_CREATED
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/logic/payment-state-machine.ts:43:5
   if (
     fromState === 'INITIATED' &&
     toState === 'PAYMENT_SUCCEEDED' &&
-    trigger !== PaymentTrigger.ReconcileRepair
+    trigger === PaymentTrigger.ReconcileRepair
   ) {
     return false;
killedBy: Payment PaymentStateMachine: rejects INITIATED -> PAYMENT_SUCCEEDED without reconcile_repair trigger
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/logic/payment-state-machine.ts:43:5
   if (
     fromState === 'INITIATED' &&
     toState === 'PAYMENT_SUCCEEDED' &&
-    trigger !== PaymentTrigger.ReconcileRepair
+    true
   ) {
     return false;
killedBy: Payment PaymentStateMachine: allows INITIATED -> PAYMENT_SUCCEEDED with reconcile_repair trigger
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/logic/payment-state-machine.ts:44:5
     fromState === 'INITIATED' &&
     toState === 'PAYMENT_SUCCEEDED' &&
     trigger !== PaymentTrigger.ReconcileRepair
-  ) {
-    return false;
-  }
+  ) {}
   return true;
 }
killedBy: Payment PaymentStateMachine: rejects INITIATED -> PAYMENT_SUCCEEDED without reconcile_repair trigger
statusReason: expected true to be false // Object.is equality
