[Killed] MethodExpression
src/logic/promo-redeem.ts:65:16
   env: { PROMO_KV?: KVNamespace; CREDITS_DO?: DurableObjectNamespace },
   preloaded?: PreloadedPromo
 ): Promise<RedeemPromoResult> {
-  const code = input.code?.trim();
+  const code = input.code;
   if (!code) {
     return { success: false, error: 'Code is required' };
killedBy: PromoRedeem redeemPromoLogic: returns error when code is whitespace only
statusReason: expected 'CREDITS_DO not configured' to be 'Code is required' // Object.is equality

[Survived] OptionalChaining
src/logic/promo-redeem.ts:65:16
   env: { PROMO_KV?: KVNamespace; CREDITS_DO?: DurableObjectNamespace },
   preloaded?: PreloadedPromo
 ): Promise<RedeemPromoResult> {
-  const code = input.code?.trim();
+  const code = input.code.trim();
   if (!code) {
     return { success: false, error: 'Code is required' };

[Killed] ConditionalExpression
src/logic/promo-redeem.ts:66:7
   preloaded?: PreloadedPromo
 ): Promise<RedeemPromoResult> {
   const code = input.code?.trim();
-  if (!code) {
+  if (false) {
     return { success: false, error: 'Code is required' };
   }
killedBy: PromoRedeem redeemPromoLogic: returns error when code is missing
statusReason: expected 'CREDITS_DO not configured' to be 'Code is required' // Object.is equality

[Killed] BlockStatement
src/logic/promo-redeem.ts:66:14
   preloaded?: PreloadedPromo
 ): Promise<RedeemPromoResult> {
   const code = input.code?.trim();
-  if (!code) {
-    return { success: false, error: 'Code is required' };
-  }
+  if (!code) {}
   if (!env.PROMO_KV) {
     return { success: false, error: 'PROMO_KV not configured' };
killedBy: PromoRedeem redeemPromoLogic: returns error when code is missing
statusReason: expected 'CREDITS_DO not configured' to be 'Code is required' // Object.is equality

[Survived] BlockStatement
src/logic/promo-redeem.ts:72:24
   if (!env.PROMO_KV) {
     return { success: false, error: 'PROMO_KV not configured' };
   }
-  if (!env.CREDITS_DO) {
-    return { success: false, error: 'CREDITS_DO not configured' };
-  }
+  if (!env.CREDITS_DO) {}
 
   let ac: number;

[Survived] ConditionalExpression
src/logic/promo-redeem.ts:72:7
   if (!env.PROMO_KV) {
     return { success: false, error: 'PROMO_KV not configured' };
   }
-  if (!env.CREDITS_DO) {
+  if (false) {
     return { success: false, error: 'CREDITS_DO not configured' };
   }

[Killed] MethodExpression
src/logic/promo-redeem.ts:80:10
   let gp: number;
 
   if (preloaded !== undefined) {
-    ac = Math.max(0, Math.floor(Number(preloaded.ac) || 0));
+    ac = Math.min(0, Math.floor(Number(preloaded.ac) || 0));
     gp = Math.max(0, Math.floor(Number(preloaded.gp) || 0));
   } else {
killedBy: PromoRedeem redeemPromoLogic: preloaded ac=100 gp=0 awards only AC (no GP path)
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/logic/promo-redeem.ts:80:33
   let gp: number;
 
   if (preloaded !== undefined) {
-    ac = Math.max(0, Math.floor(Number(preloaded.ac) || 0));
+    ac = Math.max(0, Math.floor(Number(preloaded.ac) && 0));
     gp = Math.max(0, Math.floor(Number(preloaded.gp) || 0));
   } else {
killedBy: PromoRedeem redeemPromoLogic: preloaded ac=100 gp=0 awards only AC (no GP path)
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/logic/promo-redeem.ts:81:33
 
   if (preloaded !== undefined) {
     ac = Math.max(0, Math.floor(Number(preloaded.ac) || 0));
-    gp = Math.max(0, Math.floor(Number(preloaded.gp) || 0));
+    gp = Math.max(0, Math.floor(Number(preloaded.gp) && 0));
   } else {
     const key = promoKey(code);
killedBy: PromoRedeem redeemPromoLogic: preloaded ac=0 gp=50 awards only GP (no AC path)
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/logic/promo-redeem.ts:81:10
 
   if (preloaded !== undefined) {
     ac = Math.max(0, Math.floor(Number(preloaded.ac) || 0));
-    gp = Math.max(0, Math.floor(Number(preloaded.gp) || 0));
+    gp = Math.min(0, Math.floor(Number(preloaded.gp) || 0));
   } else {
     const key = promoKey(code);
killedBy: PromoRedeem redeemPromoLogic: preloaded ac=0 gp=50 awards only GP (no AC path)
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/logic/promo-redeem.ts:94:33
     } catch {
       return { success: false, error: 'Invalid or expired code' };
     }
-    ac = Math.max(0, Math.floor(Number(promo.ac) || 0));
+    ac = Math.max(0, Math.floor(Number(promo.ac) && 0));
     gp = Math.max(0, Math.floor(Number(promo.gp) || 0));
   }
killedBy: PromoRedeem redeemPromoLogic: code normalization finds key stored under uppercase (lowercase input)
statusReason: expected undefined to be 20 // Object.is equality

[Killed] MethodExpression
src/logic/promo-redeem.ts:94:10
     } catch {
       return { success: false, error: 'Invalid or expired code' };
     }
-    ac = Math.max(0, Math.floor(Number(promo.ac) || 0));
+    ac = Math.min(0, Math.floor(Number(promo.ac) || 0));
     gp = Math.max(0, Math.floor(Number(promo.gp) || 0));
   }
killedBy: PromoRedeem redeemPromoLogic: code normalization finds key stored under uppercase (lowercase input)
statusReason: expected undefined to be 20 // Object.is equality

[Killed] MethodExpression
src/logic/promo-redeem.ts:95:10
       return { success: false, error: 'Invalid or expired code' };
     }
     ac = Math.max(0, Math.floor(Number(promo.ac) || 0));
-    gp = Math.max(0, Math.floor(Number(promo.gp) || 0));
+    gp = Math.min(0, Math.floor(Number(promo.gp) || 0));
   }
 
killedBy: PromoRedeem redeemPromoLogic: code normalization finds key stored under uppercase (lowercase input)
statusReason: expected undefined to be 10 // Object.is equality

[Killed] LogicalOperator
src/logic/promo-redeem.ts:95:33
       return { success: false, error: 'Invalid or expired code' };
     }
     ac = Math.max(0, Math.floor(Number(promo.ac) || 0));
-    gp = Math.max(0, Math.floor(Number(promo.gp) || 0));
+    gp = Math.max(0, Math.floor(Number(promo.gp) && 0));
   }
 
killedBy: PromoRedeem redeemPromoLogic: code normalization finds key stored under uppercase (lowercase input)
statusReason: expected undefined to be 10 // Object.is equality

[Killed] EqualityOperator
src/logic/promo-redeem.ts:98:7
     gp = Math.max(0, Math.floor(Number(promo.gp) || 0));
   }
 
-  if (ac === 0 && gp === 0) {
+  if (ac !== 0 && gp === 0) {
     return { success: false, error: 'Invalid or expired code' };
   }
killedBy: PromoRedeem redeemPromoLogic: returns Invalid or expired code when ac and gp are both 0
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/logic/promo-redeem.ts:98:29
     gp = Math.max(0, Math.floor(Number(promo.gp) || 0));
   }
 
-  if (ac === 0 && gp === 0) {
-    return { success: false, error: 'Invalid or expired code' };
-  }
+  if (ac === 0 && gp === 0) {}
 
   const redeemedKeyStr = redeemedKey(code, input.userId);
killedBy: PromoRedeem redeemPromoLogic: returns Invalid or expired code when ac and gp are both 0
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/logic/promo-redeem.ts:104:7
 
   const redeemedKeyStr = redeemedKey(code, input.userId);
   const existing = await env.PROMO_KV.get(redeemedKeyStr);
-  if (existing) {
+  if (false) {
     return { success: true, already_redeemed: true };
   }
killedBy: PromoRedeem redeemPromoLogic: returns already_redeemed when redeemed key exists
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/logic/promo-redeem.ts:104:17
 
   const redeemedKeyStr = redeemedKey(code, input.userId);
   const existing = await env.PROMO_KV.get(redeemedKeyStr);
-  if (existing) {
-    return { success: true, already_redeemed: true };
-  }
+  if (existing) {}
 
   await env.PROMO_KV.put(redeemedKeyStr, '1');
killedBy: PromoRedeem redeemPromoLogic: returns already_redeemed when redeemed key exists
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/logic/promo-redeem.ts:116:7
   let newAcBalance: number | undefined;
   let newGpBalance: number | undefined;
 
-  if (gp > 0) {
+  if (gp >= 0) {
     const earnResult = await earnGPLogic(
       {
killedBy: PromoRedeem redeemPromoLogic: returns failure when credit subsystem returns failure (no fake success)
statusReason: expected 'GP amount must be greater than 0' to contain 'Insufficient funds'

[Killed] ConditionalExpression
src/logic/promo-redeem.ts:116:7
   let newAcBalance: number | undefined;
   let newGpBalance: number | undefined;
 
-  if (gp > 0) {
+  if (true) {
     const earnResult = await earnGPLogic(
       {
killedBy: PromoRedeem redeemPromoLogic: returns failure when credit subsystem returns failure (no fake success)
statusReason: expected 'GP amount must be greater than 0' to contain 'Insufficient funds'

[Killed] BlockStatement
src/logic/promo-redeem.ts:129:63
       },
       env
     );
-    if (!earnResult.success && !earnResult.already_processed) {
-      await env.PROMO_KV.delete(redeemedKeyStr);
-      return { success: false, error: earnResult.error ?? 'Failed to award GP' };
-    }
+    if (!earnResult.success && !earnResult.already_processed) {}
     newGpBalance = earnResult.new_balance;
   }
killedBy: PromoRedeem redeemPromoLogic: Rule 12.1.2 GP fail rolls back redeemed key so retry can succeed once
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/logic/promo-redeem.ts:129:9
       },
       env
     );
-    if (!earnResult.success && !earnResult.already_processed) {
+    if (true) {
       await env.PROMO_KV.delete(redeemedKeyStr);
       return { success: false, error: earnResult.error ?? 'Failed to award GP' };
killedBy: PromoRedeem redeemPromoLogic: code normalization finds key stored under uppercase (lowercase input)
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/logic/promo-redeem.ts:131:39
     );
     if (!earnResult.success && !earnResult.already_processed) {
       await env.PROMO_KV.delete(redeemedKeyStr);
-      return { success: false, error: earnResult.error ?? 'Failed to award GP' };
+      return { success: false, error: earnResult.error && 'Failed to award GP' };
     }
     newGpBalance = earnResult.new_balance;
killedBy: PromoRedeem redeemPromoLogic: Rule 12.1.2 GP fail rolls back redeemed key so retry can succeed once
statusReason: expected 'Failed to award GP' to contain 'GP fail'

[Killed] BlockStatement
src/logic/promo-redeem.ts:136:15
     newGpBalance = earnResult.new_balance;
   }
 
-  if (ac > 0) {
-    const purchaseResult = await purchaseCreditsLogic(
-      {
-        userId: input.userId,
-        acAmount: ac,
-        idempotencyKey: asIdempotencyKey(idemAc),
-        source: CreditLedgerSource.Promo,
-        description: `Promo: ${normalizeCode(code)}`,
-      },
-      env
-    );
-    if (!purchaseResult.success && !purchaseResult.already_processed) {
-      return { success: false, error: purchaseResult.error ?? 'Failed to award AC', gp_added: gp > 0 ? gp : undefined, new_gp_balance: newGpBalance };
-    }
-    newAcBalance = purchaseResult.new_balance;
-  }
+  if (ac > 0) {}
 
   return {
killedBy: PromoRedeem redeemPromoLogic: returns failure when credit subsystem returns failure (no fake success)
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/logic/promo-redeem.ts:136:7
     newGpBalance = earnResult.new_balance;
   }
 
-  if (ac > 0) {
+  if (false) {
     const purchaseResult = await purchaseCreditsLogic(
       {
killedBy: PromoRedeem redeemPromoLogic: returns failure when credit subsystem returns failure (no fake success)
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/logic/promo-redeem.ts:147:9
       },
       env
     );
-    if (!purchaseResult.success && !purchaseResult.already_processed) {
+    if (false) {
       return { success: false, error: purchaseResult.error ?? 'Failed to award AC', gp_added: gp > 0 ? gp : undefined, new_gp_balance: newGpBalance };
     }
killedBy: PromoRedeem redeemPromoLogic: returns failure when credit subsystem returns failure (no fake success)
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/logic/promo-redeem.ts:147:9
       },
       env
     );
-    if (!purchaseResult.success && !purchaseResult.already_processed) {
+    if (true) {
       return { success: false, error: purchaseResult.error ?? 'Failed to award AC', gp_added: gp > 0 ? gp : undefined, new_gp_balance: newGpBalance };
     }
killedBy: PromoRedeem redeemPromoLogic: code normalization finds key stored under uppercase (lowercase input)
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/logic/promo-redeem.ts:148:39
       env
     );
     if (!purchaseResult.success && !purchaseResult.already_processed) {
-      return { success: false, error: purchaseResult.error ?? 'Failed to award AC', gp_added: gp > 0 ? gp : undefined, new_gp_balance: newGpBalance };
+      return { success: false, error: purchaseResult.error && 'Failed to award AC', gp_added: gp > 0 ? gp : undefined, new_gp_balance: newGpBalance };
     }
     newAcBalance = purchaseResult.new_balance;
killedBy: PromoRedeem redeemPromoLogic: returns failure when credit subsystem returns failure (no fake success)
statusReason: expected 'Failed to award AC' to contain 'Insufficient funds'

[Survived] ConditionalExpression
src/logic/promo-redeem.ts:148:95
       env
     );
     if (!purchaseResult.success && !purchaseResult.already_processed) {
-      return { success: false, error: purchaseResult.error ?? 'Failed to award AC', gp_added: gp > 0 ? gp : undefined, new_gp_balance: newGpBalance };
+      return { success: false, error: purchaseResult.error ?? 'Failed to award AC', gp_added: false ? gp : undefined, new_gp_balance: newGpBalance };
     }
     newAcBalance = purchaseResult.new_balance;

[Killed] ConditionalExpression
src/logic/promo-redeem.ts:155:15
 
   return {
     success: true,
-    ac_added: ac > 0 ? ac : undefined,
+    ac_added: true ? ac : undefined,
     gp_added: gp > 0 ? gp : undefined,
     new_ac_balance: newAcBalance,
killedBy: PromoRedeem redeemPromoLogic: preloaded ac=0 gp=50 awards only GP (no AC path)
statusReason: expected +0 to be undefined

[Killed] ConditionalExpression
src/logic/promo-redeem.ts:155:15
 
   return {
     success: true,
-    ac_added: ac > 0 ? ac : undefined,
+    ac_added: false ? ac : undefined,
     gp_added: gp > 0 ? gp : undefined,
     new_ac_balance: newAcBalance,
killedBy: PromoRedeem redeemPromoLogic: code normalization finds key stored under uppercase (lowercase input)
statusReason: expected undefined to be 20 // Object.is equality

[Killed] EqualityOperator
src/logic/promo-redeem.ts:156:15
   return {
     success: true,
     ac_added: ac > 0 ? ac : undefined,
-    gp_added: gp > 0 ? gp : undefined,
+    gp_added: gp <= 0 ? gp : undefined,
     new_ac_balance: newAcBalance,
     new_gp_balance: newGpBalance,
killedBy: PromoRedeem redeemPromoLogic: code normalization finds key stored under uppercase (lowercase input)
statusReason: expected undefined to be 10 // Object.is equality

[Killed] EqualityOperator
src/logic/promo-redeem.ts:156:15
   return {
     success: true,
     ac_added: ac > 0 ? ac : undefined,
-    gp_added: gp > 0 ? gp : undefined,
+    gp_added: gp >= 0 ? gp : undefined,
     new_ac_balance: newAcBalance,
     new_gp_balance: newGpBalance,
killedBy: PromoRedeem redeemPromoLogic: preloaded ac=100 gp=0 awards only AC (no GP path)
statusReason: expected +0 to be undefined
