[Killed] ConditionalExpression
src/config/plan-tiers.ts:43:10
  * @mutation-invariant true only when (now - periodStart) >= PERIOD_MS
  */
 export function isPeriodExpired(periodStart: number, now: number): boolean {
-  return now - periodStart >= PERIOD_MS;
+  return false;
 }
 
killedBy: PlanTiers isPeriodExpired: returns true at exact 30-day boundary
statusReason: expected false to be true // Object.is equality

[Killed] ArithmeticOperator
src/config/plan-tiers.ts:43:10
  * @mutation-invariant true only when (now - periodStart) >= PERIOD_MS
  */
 export function isPeriodExpired(periodStart: number, now: number): boolean {
-  return now - periodStart >= PERIOD_MS;
+  return now + periodStart >= PERIOD_MS;
 }
 
killedBy: PlanTiers isPeriodExpired: returns false before 30-day boundary
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/config/plan-tiers.ts:54:7
  * @mutation-invariant when not expired, return === max(0, allowance - tokensUsedThisPeriod)
  */
 export function getAllowanceRemaining(state: UserPlanState, tierConfig: PlanTierConfig, now: number): number {
-  if (isPeriodExpired(state.periodStart, now)) return tierConfig.monthlyTokenAllowance;
+  if (false) return tierConfig.monthlyTokenAllowance;
   const used = state.tokensUsedThisPeriod;
   return Math.max(0, tierConfig.monthlyTokenAllowance - used);
killedBy: PlanTiers getAllowanceRemaining: returns full monthly allowance when period is expired
statusReason: expected 45000 to be 100000 // Object.is equality

[Killed] ConditionalExpression
src/config/plan-tiers.ts:54:7
  * @mutation-invariant when not expired, return === max(0, allowance - tokensUsedThisPeriod)
  */
 export function getAllowanceRemaining(state: UserPlanState, tierConfig: PlanTierConfig, now: number): number {
-  if (isPeriodExpired(state.periodStart, now)) return tierConfig.monthlyTokenAllowance;
+  if (true) return tierConfig.monthlyTokenAllowance;
   const used = state.tokensUsedThisPeriod;
   return Math.max(0, tierConfig.monthlyTokenAllowance - used);
killedBy: PlanTiers getAllowanceRemaining: returns allowance minus usage when period is active
statusReason: expected 100000 to be 87655 // Object.is equality

[Killed] ArithmeticOperator
src/config/plan-tiers.ts:56:22
 export function getAllowanceRemaining(state: UserPlanState, tierConfig: PlanTierConfig, now: number): number {
   if (isPeriodExpired(state.periodStart, now)) return tierConfig.monthlyTokenAllowance;
   const used = state.tokensUsedThisPeriod;
-  return Math.max(0, tierConfig.monthlyTokenAllowance - used);
+  return Math.max(0, tierConfig.monthlyTokenAllowance + used);
 }
 
killedBy: PlanTiers getAllowanceRemaining: returns allowance minus usage when period is active
statusReason: expected 112345 to be 87655 // Object.is equality

[Killed] MethodExpression
src/config/plan-tiers.ts:56:10
 export function getAllowanceRemaining(state: UserPlanState, tierConfig: PlanTierConfig, now: number): number {
   if (isPeriodExpired(state.periodStart, now)) return tierConfig.monthlyTokenAllowance;
   const used = state.tokensUsedThisPeriod;
-  return Math.max(0, tierConfig.monthlyTokenAllowance - used);
+  return Math.min(0, tierConfig.monthlyTokenAllowance - used);
 }
 
killedBy: PlanTiers getAllowanceRemaining: returns allowance minus usage when period is active
statusReason: expected +0 to be 87655 // Object.is equality
